// mock/userProfileMock.js

export const userProfile = {
    name: "Олег Вайха",
    rating: 5.0,
    role: "Домовладелец",
    phone: "+7 (912) 345-67-89",
    avatar: require("../assets/imgs/user1.png"),
  };
  
  export const userProjects = {
    current: [
      {
        id: 1,
        description:
          "В рамках проекта планируется выполнение комплексного ремонта двухкомнатной квартиры общей площадью 65 м². Предус...",
        date: "23/04 15:46",
        image: require("../assets/imgs/proj1.png"),
        tags: [
          "Дизайн интерьера",
          "Отделка",
          "Демонтаж",
          "Электрика",
          "Сантехника",
          "Чистовая отделка",
        ],
        comments: 5,
        views: 28,
      },
      {
        id: 2,
        description:
          "Будет выполнен демонтаж старой отделки, замена всех инженерных сетей, включая электрику, водоснабжение и вентиляцию. О...",
        date: "15/07 11:06",
        image: require("../assets/imgs/proj2.png"),
        tags: [
          "Отделка",
          "Демонтаж",
          "Сантехника",
          "Шумоизоляция",
          "Дизайн интерьера",
        ],
        comments: 8,
        views: 53,
      },
    ],
    completed: [
      {
        id: 3,
        description:
          "Ремонт двушки площадью 65 м² завершён успешно. Все работы выполнены в срок, результат полностью устроил клиента.",
        image: require("../assets/imgs/proj1.png"),
        tags: [
            "Отделка",
            "Демонтаж",
            "Сантехника",
            "Шумоизоляция",
            "Дизайн интерьера",
          ],
          comments: 8,
          views: 53,
      },
    ],
  };
  